-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\ado\ian\siman\Ian\testing1.log
  log type:  text
 opened on:  17 Feb 2022, 12:49:38

. /*
> Ian's testing: 1st data set
> Updated 17/2/2022
> Updated 22/12/2021
> In due course, remove all the "cap noi"s and make this a test file
> */
. 
. prog drop _all

. 
. use http://www.homepages.ucl.ac.uk/~rmjwiww/stata/misc/MIsim, clear
(simsum example: data from a simulation study comparing 3 ways to handle missing )

. cap noi siman setup, rep(dataset) method(method) 
siman would like to name a variable 'dataset', but that name already exists in your data.  Please rename your variable dataset as s
> omething else.

. rename dataset myrep

. siman setup, rep(myrep) method(method) 

                   SUMMARY OF DATA
_____________________________________________________

The import format is:             format 1: long-long
The import format for targets is: long
The import format for methods is: long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            CC MI_LOGT MI_T

Data generating mechanism (dgm):  not in dataset
The number of dgms is:            N/A

Estimates are not contained in the dataset

The estimates variable is:        N/A
The se variable is:               N/A
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true-value variable is:       N/A
_____________________________________________________

. cap noi siman analyse // WANT BETTER ERROR MESSAGE
c:\ado\ian\siman\simsumv2.ado
*! version 0.19 Ian White 8jan2020
varlist required

. 
. use http://www.homepages.ucl.ac.uk/~rmjwiww/stata/misc/MIsim, clear
(simsum example: data from a simulation study comparing 3 ways to handle missing )

. rename dataset myrep

. siman setup, rep(myrep) method(method) est(b) se(se)

                   SUMMARY OF DATA
_____________________________________________________

The import format is:             format 1: long-long
The import format for targets is: long
The import format for methods is: long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            CC MI_LOGT MI_T

Data generating mechanism (dgm):  not in dataset
The number of dgms is:            N/A

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true-value variable is:       N/A
_____________________________________________________

. siman analyse
c:\ado\ian\siman\simsumv2.ado
*! version 0.19 Ian White 8jan2020

---------------------------------------------
performance measure  |
and method           |          b          se
---------------------+-----------------------
bsims                |
                  CC |       1000            
             MI_LOGT |       1000            
                MI_T |       1000            
---------------------+-----------------------
sesims               |
                  CC |       1000            
             MI_LOGT |       1000            
                MI_T |       1000            
---------------------+-----------------------
empse                |
                  CC |    .151115    .0033807
             MI_LOGT |   .1320064    .0029532
                MI_T |   .1344277    .0030074
---------------------+-----------------------
relprec              |
                  CC |                       
             MI_LOGT |   31.04635    3.937473
                MI_T |   26.36818     3.84238
---------------------+-----------------------
modelse              |
                  CC |   .1470963    .0005274
             MI_LOGT |   .1349413    .0006046
                MI_T |   .1338346    .0005856
---------------------+-----------------------
relerror             |
                  CC |  -2.659391    2.205482
             MI_LOGT |   2.223258    2.332338
                MI_T |   -.441223    2.269522
---------------------+-----------------------
power                |
                  CC |       94.6    .7147308
             MI_LOGT |       96.9    .5480784
                MI_T |       96.3    .5969169
---------------------+-----------------------
mean                 |
                  CC |   .5167662    .0047787
             MI_LOGT |   .5009231    .0041744
                MI_T |   .4988092     .004251
---------------------+-----------------------
ciwidth              |
                  CC |   .5730629    .0020195
             MI_LOGT |   .5241634    .0022487
                MI_T |   .5201368    .0021658
---------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is standard error and 
 the second entry is monte carlo error.

. * check
. assert b==float(94.6) if perfmeascode=="power" & method=="CC"

. 
. use http://www.homepages.ucl.ac.uk/~rmjwiww/stata/misc/MIsim, clear
(simsum example: data from a simulation study comparing 3 ways to handle missing )

. rename dataset rep

. gen mydgm=1

. siman setup, rep(rep) method(method) dgm(mydgm) est(b) se(se) true(0.5)

                   SUMMARY OF DATA
_____________________________________________________

The import format is:             format 1: long-long
The import format for targets is: long
The import format for methods is: long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            CC MI_LOGT MI_T

Data generating mechanism (dgm):  mydgm
The number of dgms is:            1

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true-value variable is:       0.5
_____________________________________________________

. siman analyse
c:\ado\ian\siman\simsumv2.ado
*! version 0.19 Ian White 8jan2020

---------------------------------------------
performance measure  |
and method           |          b          se
---------------------+-----------------------
bsims                |
                  CC |       1000            
             MI_LOGT |       1000            
                MI_T |       1000            
---------------------+-----------------------
sesims               |
                  CC |       1000            
             MI_LOGT |       1000            
                MI_T |       1000            
---------------------+-----------------------
bias                 |
                  CC |   .0167662    .0047787
             MI_LOGT |   .0009231    .0041744
                MI_T |  -.0011908     .004251
---------------------+-----------------------
empse                |
                  CC |    .151115    .0033807
             MI_LOGT |   .1320064    .0029532
                MI_T |   .1344277    .0030074
---------------------+-----------------------
relprec              |
                  CC |                       
             MI_LOGT |   31.04635    3.937473
                MI_T |   26.36818     3.84238
---------------------+-----------------------
mse                  |
                  CC |    .023094    .0011338
             MI_LOGT |   .0174091    .0008813
                MI_T |   .0180542    .0009112
---------------------+-----------------------
modelse              |
                  CC |   .1470963    .0005274
             MI_LOGT |   .1349413    .0006046
                MI_T |   .1338346    .0005856
---------------------+-----------------------
relerror             |
                  CC |  -2.659391    2.205482
             MI_LOGT |   2.223258    2.332338
                MI_T |   -.441223    2.269522
---------------------+-----------------------
cover                |
                  CC |       94.3    .7331505
             MI_LOGT |       94.9    .6956938
                MI_T |       94.3    .7331505
---------------------+-----------------------
power                |
                  CC |       94.6    .7147308
             MI_LOGT |       96.9    .5480784
                MI_T |       96.3    .5969169
---------------------+-----------------------
mean                 |
                  CC |   .5167662    .0047787
             MI_LOGT |   .5009231    .0041744
                MI_T |   .4988092     .004251
---------------------+-----------------------
rmse                 |
                  CC |   .1519671    .0245483
             MI_LOGT |   .1319436    .0253109
                MI_T |   .1343657    .0252359
---------------------+-----------------------
ciwidth              |
                  CC |   .5730629    .0020195
             MI_LOGT |   .5241634    .0022487
                MI_T |   .5201368    .0021658
---------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is standard error and 
 the second entry is monte carlo error.

. * check
. assert b==float(94.6) if perfmeascode=="power" & method=="CC"

. 
. cap noi siman table if pe=="power" 
'if' can only be used for dgm, method and target.

. siman table power

---------------------------------------------
performance measure  |
and method           |          b          se
---------------------+-----------------------
power                |
                  CC |       94.6    .7147308
             MI_LOGT |       96.9    .5480784
                MI_T |       96.3    .5969169
---------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is standard error and 
 the second entry is monte carlo error.

. siman table if mydgm==1

---------------------------------------------
performance measure  |
and method           |          b          se
---------------------+-----------------------
bsims                |
                  CC |       1000            
             MI_LOGT |       1000            
                MI_T |       1000            
---------------------+-----------------------
sesims               |
                  CC |       1000            
             MI_LOGT |       1000            
                MI_T |       1000            
---------------------+-----------------------
bias                 |
                  CC |   .0167662    .0047787
             MI_LOGT |   .0009231    .0041744
                MI_T |  -.0011908     .004251
---------------------+-----------------------
empse                |
                  CC |    .151115    .0033807
             MI_LOGT |   .1320064    .0029532
                MI_T |   .1344277    .0030074
---------------------+-----------------------
relprec              |
                  CC |                       
             MI_LOGT |   31.04635    3.937473
                MI_T |   26.36818     3.84238
---------------------+-----------------------
mse                  |
                  CC |    .023094    .0011338
             MI_LOGT |   .0174091    .0008813
                MI_T |   .0180542    .0009112
---------------------+-----------------------
modelse              |
                  CC |   .1470963    .0005274
             MI_LOGT |   .1349413    .0006046
                MI_T |   .1338346    .0005856
---------------------+-----------------------
relerror             |
                  CC |  -2.659391    2.205482
             MI_LOGT |   2.223258    2.332338
                MI_T |   -.441223    2.269522
---------------------+-----------------------
cover                |
                  CC |       94.3    .7331505
             MI_LOGT |       94.9    .6956938
                MI_T |       94.3    .7331505
---------------------+-----------------------
power                |
                  CC |       94.6    .7147308
             MI_LOGT |       96.9    .5480784
                MI_T |       96.3    .5969169
---------------------+-----------------------
mean                 |
                  CC |   .5167662    .0047787
             MI_LOGT |   .5009231    .0041744
                MI_T |   .4988092     .004251
---------------------+-----------------------
rmse                 |
                  CC |   .1519671    .0245483
             MI_LOGT |   .1319436    .0253109
                MI_T |   .1343657    .0252359
---------------------+-----------------------
ciwidth              |
                  CC |   .5730629    .0020195
             MI_LOGT |   .5241634    .0022487
                MI_T |   .5201368    .0021658
---------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is standard error and 
 the second entry is monte carlo error.

. cap noi siman table if mydgm==2
no observations

. assert _rc==2000

. 
. // START GRAPHICS
. 
. siman scatter, bygr(row(1) title(My graph)) ytitle(Point estimate)
Working.....

. 
. siman comparemethodsscatter // graph looks really strange
working.......

. 
. siman swarm, xtitle(Point est) title(My simulation)
Working.....

. 
. siman blandaltman
working....

. siman table power // i keep doing this to check the data haven't been changed

---------------------------------------------
performance measure  |
and method           |          b          se
---------------------+-----------------------
power                |
                  CC |       94.6    .7147308
             MI_LOGT |       96.9    .5480784
                MI_T |       96.3    .5969169
---------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is standard error and 
 the second entry is monte carlo error.

. 
. siman zipplot, bygr(row(1) title(My sim))
(0 real changes made)
(0 real changes made)

. 
. * lollyplot rquires dgm named dgm
. use http://www.homepages.ucl.ac.uk/~rmjwiww/stata/misc/MIsim, clear
(simsum example: data from a simulation study comparing 3 ways to handle missing )

. rename dataset rep

. gen dgm=1

. siman setup, rep(rep) method(method) dgm(dgm) est(b) se(se) true(0.5)

                   SUMMARY OF DATA
_____________________________________________________

The import format is:             format 1: long-long
The import format for targets is: long
The import format for methods is: long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         3
The method values are:            CC MI_LOGT MI_T

Data generating mechanism (dgm):  dgm
The number of dgms is:            1

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true-value variable is:       0.5
_____________________________________________________

. siman analyse
c:\ado\ian\siman\simsumv2.ado
*! version 0.19 Ian White 8jan2020

---------------------------------------------
performance measure  |
and method           |          b          se
---------------------+-----------------------
bsims                |
                  CC |       1000            
             MI_LOGT |       1000            
                MI_T |       1000            
---------------------+-----------------------
sesims               |
                  CC |       1000            
             MI_LOGT |       1000            
                MI_T |       1000            
---------------------+-----------------------
bias                 |
                  CC |   .0167662    .0047787
             MI_LOGT |   .0009231    .0041744
                MI_T |  -.0011908     .004251
---------------------+-----------------------
empse                |
                  CC |    .151115    .0033807
             MI_LOGT |   .1320064    .0029532
                MI_T |   .1344277    .0030074
---------------------+-----------------------
relprec              |
                  CC |                       
             MI_LOGT |   31.04635    3.937473
                MI_T |   26.36818     3.84238
---------------------+-----------------------
mse                  |
                  CC |    .023094    .0011338
             MI_LOGT |   .0174091    .0008813
                MI_T |   .0180542    .0009112
---------------------+-----------------------
modelse              |
                  CC |   .1470963    .0005274
             MI_LOGT |   .1349413    .0006046
                MI_T |   .1338346    .0005856
---------------------+-----------------------
relerror             |
                  CC |  -2.659391    2.205482
             MI_LOGT |   2.223258    2.332338
                MI_T |   -.441223    2.269522
---------------------+-----------------------
cover                |
                  CC |       94.3    .7331505
             MI_LOGT |       94.9    .6956938
                MI_T |       94.3    .7331505
---------------------+-----------------------
power                |
                  CC |       94.6    .7147308
             MI_LOGT |       96.9    .5480784
                MI_T |       96.3    .5969169
---------------------+-----------------------
mean                 |
                  CC |   .5167662    .0047787
             MI_LOGT |   .5009231    .0041744
                MI_T |   .4988092     .004251
---------------------+-----------------------
rmse                 |
                  CC |   .1519671    .0245483
             MI_LOGT |   .1319436    .0253109
                MI_T |   .1343657    .0252359
---------------------+-----------------------
ciwidth              |
                  CC |   .5730629    .0020195
             MI_LOGT |   .5241634    .0022487
                MI_T |   .5201368    .0021658
---------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is standard error and 
 the second entry is monte carlo error.

. siman lollyplot bias 
working....

. 
. siman nestloop power
working....
(simsum example: data from a simulation study comparing 3 ways to handle missing )

. 
. siman trellis power
working....

. 
. siman table power

---------------------------------------------
performance measure  |
and method           |          b          se
---------------------+-----------------------
power                |
                  CC |       94.6    .7147308
             MI_LOGT |       96.9    .5480784
                MI_T |       96.3    .5969169
---------------------------------------------
 NOTE: Where there are 2 entries in the table, 
 the first entry is standard error and 
 the second entry is monte carlo error.

. assert b==float(94.6) if perfmeascode=="power" & method=="CC"

. 
. *** END OF TESTING1.DO ***
. 
end of do-file
      name:  <unnamed>
       log:  C:\ado\ian\siman\Ian\testing1.log
  log type:  text
 closed on:  17 Feb 2022, 12:50:04
-----------------------------------------------------------------------------------------------------------------------------------
