-----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\ado\ian\siman\Ian\testing3.log
  log type:  text
 opened on:  11 Jun 2020, 16:24:13
Log file testing3.log opened on 11 Jun 2020 at 16:24:13

. * Ian's testing
. * 3rd data set
. * to Ella by 26/6/2020
. prog drop _all

. /* making the test3 file:
> cd "N:\Home\Design\Sample size\artcat\sim"
> myadopath simrun
> simcombine, settings(simsettings) program(eval2mysim) genid(rep)
> keep if rep<=1000
> label data "artcat sim eval2 (1% sample) to test siman"
> save C:\ado\ian\siman\Ian\test3, replace
> */
. use C:\ado\ian\siman\Ian\test3, clear
(artcat sim eval2 (1% sample) to test siman)

. * this is a sim to evaluate power 
. * b, se imply Wald test; also p_lr for LRT
. 
. * let's first look at estimation
. gen true = log(cond(null,1,or))

. gen method = "ologit"

. siman setup, rep(rep) dgm(pc null or) est(b) se(se) true(true) method(method)

                   SUMMARY OF DATA
_____________________________________________________

The import format is:             format 1: long-long
The import format for targets is: long
The import format for methods is: long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         1
The method values are:            ologit

Data generating mechanism (dgm):  pc null or
The number of dgms is:            3

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________

. * output "The number of dgms is: 3" is wrong
. *       actually 28 dgms
. siman ana, notable
c:\ado\ian\siman\simsumv2.ado
*! version 0.19 Ian White 8jan2020
(28,000 real changes made)
(0 observations deleted)
file C:\Users\rmjwiww\AppData\Local\Temp\ST_182c_000003.tmp saved
(0 observations deleted)
1 2 3 4 5 6 7 8 9 10 11 12 13
(28,000 real changes made)
siman analyse has run

. * need to drop unwanted output
. siman table if null, col(or)

--------------------------------------------------------------------------------------------------------
                     |                                   or and method                                  
null, Performance    | --- .2 --   --- .3 --   --- .4 --   --- .5 --   --- .6 --   --- .7 --   --- .8 --
measure and pc       |    ologit      ologit      ologit      ologit      ologit      ologit      ologit
---------------------+----------------------------------------------------------------------------------
1                    |
bias                 |
                  .2 |  -.005576    .0154313   -.0027399    .0065278   -.0017222   -.0005252    -.000198
                     |  .0117268    .0093502    .0074563    .0060756    .0044598    .0033368    .0021015
---------------------+----------------------------------------------------------------------------------
1                    |
bsims                |
                  .2 |      1000        1000        1000        1000        1000        1000        1000
                     |                                                                                  
---------------------+----------------------------------------------------------------------------------
1                    |
ciwidth              |
                  .2 |  1.420664    1.162404    .9423838    .7430623    .5677303    .4073292     .260652
                     |  .0026916    .0017095    .0011035      .00071    .0003791    .0002006    .0000805
---------------------+----------------------------------------------------------------------------------
1                    |
cover                |
                  .2 |        95        95.7        95.6        94.9        95.5          94        94.7
                     |  .6892024    .6414907    .6485677    .6956938    .6555532    .7509993    .7084563
---------------------+----------------------------------------------------------------------------------
1                    |
empse                |
                  .2 |  .3708327    .2956781    .2357904    .1921262    .1410325    .1055198    .0664559
                     |  .0082962    .0066149    .0052751    .0042982    .0031552    .0023607    .0014867
---------------------+----------------------------------------------------------------------------------
1                    |
mean                 |
                  .2 |  -.005576    .0154313   -.0027399    .0065278   -.0017222   -.0005252    -.000198
                     |  .0117268    .0093502    .0074563    .0060756    .0044598    .0033368    .0021015
---------------------+----------------------------------------------------------------------------------
1                    |
modelse              |
                  .2 |  .3630702    .2968573    .2405731    .1896466    .1448641     .103925    .0664973
                     |  .0006996    .0004426    .0002849    .0001826    .0000971    .0000513    .0000206
---------------------+----------------------------------------------------------------------------------
1                    |
mse                  |
                  .2 |  .1374104    .0875762     .055549    .0369182    .0198732    .0111236     .004412
                     |  .0062453    .0041498     .002462    .0017384    .0009154    .0004763    .0001907
---------------------+----------------------------------------------------------------------------------
1                    |
power                |
                  .2 |         5         4.3         4.4         5.1         4.5           6         5.3
                     |  .6892024    .6414905    .6485677    .6956939    .6555532    .7509993    .7084561
---------------------+----------------------------------------------------------------------------------
1                    |
relerror             |
                  .2 |  -2.09326    .3988082    2.028366   -1.290586    2.716807   -1.511407     .062234
                     |  2.198467    2.251091     2.28576    2.210359    2.298997    2.203909    2.238793
---------------------+----------------------------------------------------------------------------------
1                    |
relprec              |
                  .2 |                                                                                  
                     |                                                                                  
---------------------+----------------------------------------------------------------------------------
1                    |
rmse                 |
                  .2 |  .3706891    .2959328    .2356884     .192141    .1409725    .1054684     .066423
                     |  .0227249    .0236926    .0221604    .0235443     .023032    .0214105    .0216147
---------------------+----------------------------------------------------------------------------------
1                    |
sesims               |
                  .2 |      1000        1000        1000        1000        1000        1000        1000
                     |                                                                                  
--------------------------------------------------------------------------------------------------------

. siman table if !null, col(or)

--------------------------------------------------------------------------------------------------------
                     |                                   or and method                                  
null, Performance    | --- .2 --   --- .3 --   --- .4 --   --- .5 --   --- .6 --   --- .7 --   --- .8 --
measure and pc       |    ologit      ologit      ologit      ologit      ologit      ologit      ologit
---------------------+----------------------------------------------------------------------------------
0                    |
bias                 |
                  .1 | -.0654008   -.0445475    -.008279   -.0198891   -.0078131    .0007048    .0032903
                     |  .0183578    .0133883    .0094724    .0069484    .0051396    .0035629    .0022376
                     | 
                  .2 | -.1034669   -.0375558   -.0089047   -.0086417    .0034838   -.0030918   -.0028517
                     |  .0183604    .0130925    .0095615    .0068961    .0052112    .0035498    .0021236
                     | 
                  .4 | -.0891125     .002832   -.0066728   -.0071322    .0004767   -.0064234   -.0026079
                     |  .0181145     .011979    .0092299    .0069747    .0049173    .0035447    .0021737
---------------------+----------------------------------------------------------------------------------
0                    |
bsims                |
                  .1 |       993         999        1000        1000        1000        1000        1000
                     |                                                                                  
                     | 
                  .2 |       995        1000        1000        1000        1000        1000        1000
                     |                                                                                  
                     | 
                  .4 |       995        1000        1000        1000        1000        1000        1000
                     |                                                                                  
---------------------+----------------------------------------------------------------------------------
0                    |
ciwidth              |
                  .1 |   2.29567    1.592418    1.159142    .8586638    .6252428    .4336682    .2705545
                     |  .0166528    .0074478     .002953    .0015517     .000712    .0003324     .000122
                     | 
                  .2 |  2.274517      1.5681    1.151518    .8537059    .6236236    .4332354    .2704134
                     |  .0164111    .0062128    .0026691    .0012094    .0006036    .0002585    .0000981
                     | 
                  .4 |  2.155449    1.511234    1.130132    .8475999    .6209401     .432831    .2701355
                     |  .0117634     .003318    .0014011    .0006659    .0002919    .0001184    .0000389
---------------------+----------------------------------------------------------------------------------
0                    |
cover                |
                  .1 |  96.57603     96.1962        95.2        95.3        94.3        94.2        94.8
                     |   .577065    .6052088    .6759884    .6692606    .7331505    .7391618    .7021109
                     | 
                  .2 |  97.98995        95.6        95.3          95        95.1        94.7        95.1
                     |  .4449205    .6485677    .6692606    .6892024    .6826347    .7084563    .6826347
                     | 
                  .4 |  96.98492        96.2        95.3        95.2        96.7        94.7        95.9
                     |  .5421128    .6046158    .6692606    .6759884    .5648985    .7084563    .6270486
---------------------+----------------------------------------------------------------------------------
0                    |
empse                |
                  .1 |  .5784907    .4231645     .299543    .2197274     .162528    .1126701    .0707584
                     |  .0129875    .0094717    .0067013    .0049157    .0036361    .0025206     .001583
                     | 
                  .2 |  .5791522    .4140217    .3023621    .2180724    .1647923    .1122551    .0671528
                     |  .0129893    .0092624    .0067644    .0048787    .0036867    .0025114    .0015023
                     | 
                  .4 |  .5713974     .378809    .2918766    .2205596    .1554994    .1120934    .0687378
                     |  .0128153    .0084747    .0065298    .0049343    .0034788    .0025077    .0015378
---------------------+----------------------------------------------------------------------------------
0                    |
mean                 |
                  .1 | -1.674839    -1.24852   -.9245697   -.7130362   -.5186387   -.3559701   -.2198532
                     |  .0183578    .0133883    .0094724    .0069484    .0051396    .0035629    .0022376
                     | 
                  .2 | -1.712905   -1.241529   -.9251954   -.7017888   -.5073418   -.3597667   -.2259953
                     |  .0183604    .0130925    .0095615    .0068961    .0052112    .0035498    .0021236
                     | 
                  .4 |  -1.69855   -1.201141   -.9229635   -.7002794   -.5103489   -.3630983   -.2257514
                     |  .0181145     .011979    .0092299    .0069747    .0049173    .0035447    .0021737
---------------------+----------------------------------------------------------------------------------
0                    |
modelse              |
                  .1 |  .6007314    .4106469    .2966619    .2194079    .1596069    .1106642    .0690273
                     |  .0049348    .0022459    .0007808    .0004052     .000183    .0000849    .0000311
                     | 
                  .2 |   .595068    .4031573    .2945473    .2180043     .159165    .1105409    .0689888
                     |  .0049808     .001759     .000701    .0003122    .0001548     .000066    .0000251
                     | 
                  .4 |  .5579498    .3864532    .2885255    .2162951    .1584235    .1104222    .0689141
                     |  .0036402    .0008811    .0003618    .0001712    .0000748    .0000302    9.93e-06
---------------------+----------------------------------------------------------------------------------
0                    |
mse                  |
                  .1 |  .3385918    .1808734    .0897048    .0486274      .02645    .0126824    .0050126
                     |   .016473    .0099004    .0042449    .0024347    .0012137    .0005692    .0002191
                     | 
                  .2 |  .3457856     .172653    .0914107    .0475827    .0271415    .0125982    .0045131
                     |  .0178755    .0086203    .0041314    .0020879    .0011787    .0005751    .0002232
                     | 
                  .4 |  .3341079    .1433608    .0851513    .0486488    .0241561    .0125936     .004727
                     |  .0177291    .0070996    .0036032    .0020204    .0011481     .000614    .0002104
---------------------+----------------------------------------------------------------------------------
0                    |
power                |
                  .1 |   91.8429    90.89089        89.9        91.3          90        89.7        88.7
                     |  .8685923    .9103646     .952885    .8912405    .9486833    .9612025    1.001154
                     | 
                  .2 |  92.66331        90.8        89.3        91.4          89        89.8        91.2
                     |  .8265941    .9139802    .9775018    .8865889    .9894443    .9570579    .8958573
                     | 
                  .4 |   91.7588        90.5        89.7        89.7          90        90.7        90.7
                     |  .8717815     .927227    .9612025    .9612025    .9486833    .9184281    .9184281
---------------------+----------------------------------------------------------------------------------
0                    |
relerror             |
                  .1 |  3.844597    -2.95808    -.961835    -.145392   -1.797293   -1.780407   -2.446532
                     |  2.482541    2.235996    2.230948    2.241533    2.199862    2.198648    2.182897
                     | 
                  .2 |  2.748112   -2.624108   -2.584572   -.0312274   -3.414768   -1.527031    2.734054
                     |  2.459689    2.219522    2.191662    2.241067    2.162834    2.203808    2.298656
                     | 
                  .4 | -2.353455    2.017966   -1.148119   -1.933486    1.880428   -1.490856    .2564864
                     |  2.280801    2.294154    2.214972    2.195304    2.279763    2.203999    2.242971
---------------------+----------------------------------------------------------------------------------
0                    |
relprec              |
                  .1 |                                                                                  
                     |                                                                                  
                     | 
                  .2 |                                                                                  
                     |                                                                                  
                     | 
                  .4 |                                                                                  
                     |                                                                                  
---------------------+----------------------------------------------------------------------------------
0                    |
rmse                 |
                  .1 |  .5818864    .4252921    .2995077    .2205162    .1626345     .112616    .0707995
                     |  .0243257    .0273684    .0236604    .0250346    .0229441    .0224422    .0218532
                     | 
                  .2 |  .5880354    .4155153     .302342    .2181346    .1647467    .1122415    .0671798
                     |  .0258476    .0249642    .0225978    .0219401    .0217146    .0228238     .024732
                     | 
                  .4 |  .5780207    .3786302    .2918069    .2205646    .1554224    .1122213    .0687529
                     |   .026532    .0247614    .0211574    .0207649    .0237645    .0243777    .0222571
---------------------+----------------------------------------------------------------------------------
0                    |
sesims               |
                  .1 |       993         999        1000        1000        1000        1000        1000
                     |                                                                                  
                     | 
                  .2 |       995        1000        1000        1000        1000        1000        1000
                     |                                                                                  
                     | 
                  .4 |       995        1000        1000        1000        1000        1000        1000
                     |                                                                                  
--------------------------------------------------------------------------------------------------------

. 
. * now playing with reshape
. siman reshape, longlong

. siman analyse, replace notable
c:\ado\ian\siman\simsumv2.ado
*! version 0.19 Ian White 8jan2020
(364 observations deleted)
(28,000 real changes made)
(0 observations deleted)
file C:\Users\rmjwiww\AppData\Local\Temp\ST_182c_000003.tmp saved
(0 observations deleted)
1 2 3 4 5 6 7 8 9 10 11 12 13
(label indilab already defined)
(28,000 real changes made)
siman analyse has run

. siman reshape, longwide

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    28364   ->   28364
Number of variables                  12   ->      11
j variable (1 values)            method   ->   (dropped)
xij variables:
                                      b   ->   bologit
                                     se   ->   seologit
                                   true   ->   trueologit
-----------------------------------------------------------------------------

                   SUMMARY OF DATA
_____________________________________________________

The import format is:             format 3: long-wide
The import format for targets is: long
The import format for methods is: wide
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         1
The method values are:            ologit

Data generating mechanism (dgm):  pc null or
The number of dgms is:            3

Estimates are contained in the dataset

The estimates stub is:            b
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    N/A
The true stub is:                 true
_____________________________________________________

. siman analyse, replace notable
c:\ado\ian\siman\simsumv2.ado
*! version 0.19 Ian White 8jan2020
(364 observations deleted)
(28,000 real changes made)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    28000   ->   28000
Number of variables                  10   ->      11
j variable (1 values)                     ->   method
xij variables:
                                bologit   ->   b
                               seologit   ->   se
                             trueologit   ->   true
-----------------------------------------------------------------------------
(0 observations deleted)
file C:\Users\rmjwiww\AppData\Local\Temp\ST_182c_000004.tmp saved
(28,000 observations deleted)
(label indilab already defined)

                   SUMMARY OF DATA
_____________________________________________________

The import format is:             format 1: long-long
The import format for targets is: long
The import format for methods is: long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         1
The method values are:            ologit

Data generating mechanism (dgm):  pc null or
The number of dgms is:            3

Estimates are contained in the dataset

The estimates variable is:        b
The se variable is:               se
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                N/A
The true variable is:             true
_____________________________________________________
(0 observations deleted)
file C:\Users\rmjwiww\AppData\Local\Temp\ST_182c_000003.tmp saved
(0 observations deleted)
1 2 3 4 5 6 7 8 9 10 11 12 13
(label indilab already defined)
(28,000 real changes made)
siman analyse has run

. * discuss: do we want the reshape output (a) on reshape (b) on analyse?
. 
. 
. * now compare powers of methods
. use C:\ado\ian\siman\Ian\test3, clear
(artcat sim eval2 (1% sample) to test siman)

. * can I get wald test automatically instead of the following?
. gen p_wald = chi2tail(1,(b/se)^2)
(18 missing values generated)

. 
. siman setup, rep(rep) dgm(pc null or) method(wald lr) p(p)

                   SUMMARY OF DATA
_____________________________________________________

The import format is:             format 3: long-wide
The import format for targets is: long
The import format for methods is: wide
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         2
The method values are:            wald lr

Data generating mechanism (dgm):  pc null or
The number of dgms is:            3

Estimates are not contained in the dataset

The estimates stub is:            N/A
The se stub is:                   N/A
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    p
The true variable is:             N/A
_____________________________________________________

. * p(p) and p(p_) both seem to work - why?
. 
. cap noi siman ana
c:\ado\ian\siman\simsumv2.ado
*! version 0.19 Ian White 8jan2020
(28,000 real changes made)
(note: pwald not found)
(note: plr not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    28000   ->   56000
Number of variables                  10   ->      12
j variable (2 values)                     ->   method
xij variables:
                              pwald plr   ->   p
-----------------------------------------------------------------------------

                   SUMMARY OF DATA
_____________________________________________________

The import format is:             format 1: long-long
The import format for targets is: long
The import format for methods is: long
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         2
The method values are:            wald lr

Data generating mechanism (dgm):  pc null or
The number of dgms is:            3

Estimates are not contained in the dataset

The estimates variable is:        N/A
The se variable is:               N/A
The df variable is:               N/A
The ci variables are:             N/A
The p variable is:                p
The true variable is:             N/A
_____________________________________________________
(0 observations deleted)
file C:\Users\rmjwiww\AppData\Local\Temp\ST_182c_000003.tmp saved
(0 observations deleted)
variable N not found

. * seems to be wrongly picking up an N/A 
. 
. 
. use C:\ado\ian\siman\Ian\test3, clear
(artcat sim eval2 (1% sample) to test siman)

. * now doing a really silly thing
. gen p_wald = chi2tail(1,(b/se)^2)
(18 missing values generated)

. cap noi siman setup, rep(rep) dgm(pc null or) method(wald lr) p(p) est(b) se(se)

                   SUMMARY OF DATA
_____________________________________________________

The import format is:             format 3: long-wide
The import format for targets is: long
The import format for methods is: wide
The number of targets is:         N/A
The target values are:            N/A

The number of methods is:         2
The method values are:            wald lr

Data generating mechanism (dgm):  pc null or
The number of dgms is:            3

Estimates are contained in the dataset

The estimates stub is:            b
The se stub is:                   se
The df stub is:                   N/A
The ci stubs are:                 N/A
The p stub is:                    p
The true variable is:             N/A
_____________________________________________________

. * p and b weren't balanced - can this be picked up?
. 
end of do-file
Log file testing3.log completed on 11 Jun 2020 at 16:24:18
      name:  <unnamed>
       log:  C:\ado\ian\siman\Ian\testing3.log
  log type:  text
 closed on:  11 Jun 2020, 16:24:18
-----------------------------------------------------------------------------------------------------------
